app/controllers/sessions_controller.rb

SELECT  "users".* FROM "users" WHERE "users"."depto" = ? LIMIT ?  [["depto", ""], ["LIMIT", 1]]
---
  def create
    user = User.find_by(depto: params[:session][:depto].downcase) #parece que hay que actualizar los atributos