app/controllers/stats_controller.rb

  def destroy
    @stat.destroy
---
DELETE FROM "stats" WHERE "stats"."id" = ?  [["id", 980190962]]

    def set_stat
      @stat = Stat.find(params[:id])
---
SELECT  "stats".* FROM "stats" WHERE "stats"."id" = ? LIMIT ?  [["id", 980190962], ["LIMIT", 1]]