app/controllers/users_controller.rb

INSERT INTO "users" ("depto", "condo", "created_at", "updated_at", "password_digest") VALUES (?, ?, ?, ?, ?)
---
  def create
    puts "»»»»" * 20
    @place = Place.find(params[:place_id])
    @user = @place.users.build(user_params) #actualizado para la asociación con 'Place'
   if @user.save

SELECT  "users".* FROM "users" WHERE "users"."id" IS NULL LIMIT ?  [["LIMIT", 1]]
---
      def set_user
        @user = User.find(params[:id])